[
      {
        "name": "Naruto",
        "id": 1,
        "rating": "8.10",
        "author": "Masashi Kishimoto",
        "chapterNumber": "712",
        "description": "On the day of Naruto Uzamaki's birth the village of Konoha was attacked by the 9-tailed fox demon. In order to protect the village Naruto's father the 4th hokage sacrificed his life and sealed the demon in his new born son. 13 years later Naruto graduates the ninja academy and becomes a shinobi with goal to be the hokage of the village. Joining him are rival Sasuke Uchiha who attempts to gain power to avenge his clan after they were murdered by his older brother Itachi. And Sakura Haruno who is Naruto's love interest who of course loves his rival Sasuke. But when itachi returns to the village after the chunnin exams and Sasuke proves to be powerless against him. Sasuke will fall to the villainous Orochimaru to gain power. Naruto must do everything in his power to stop his friend from loosing himself to darkness even if it means losing himself.",
        "price": "$1",
        "genres": "action, comedy, drama, fantasy",
        "imageName": "naruto"
      },
    {
      "name": "Bleach",
      "id": 2,
      "rating": "8.11",
      "author": "Tite Kubo",
      "chapterNumber": "708",
      "description": "Bleach follows the adventures of Ichigo Kurosaki, a teenager with the ability to see spirits,who accidentally steals the powers of the Soul Reaper Rukia Kuchiki while saving his family and subsequently assumes her duties while she convalesces. Since that event, Ichigo has to fight hollows, evil spirits that attack people.In the process he makes new Friends with special abilities. After various events, Rukia is sentenced to death by her Soul Reapers' superiors for her actions, leading Ichigo to encounter them to save her life. He also encounters former Soul Reaper Sōsuke Aizen, who created an army of powerful hollow called arrancar to destroy the Soul Reapers organization, Soul Society.",
      "price": "$1",
      "genres": "action, supernatural",
      "imageName": "bleach"
    },
    {
      "name": "One Piece",
      "id": 3,
      "rating": "8.67",
      "author": "Eiichiro Oda",
      "chapterNumber": "1055",
      "description": "Twenty two years ago, the legendary pirate, Gold Roger was executed. His final words told that his treasure known as 'One Piece' was hidden somewhere on the Grand Line. This started the Age of Pirates. Now, twenty two years later, seventeen year old Monkey D. Luffy desires to find One Piece, and become the Pirate King. But to do this, he needs a crew.",
      "price": "$1.5",
      "genres": "adventure, comedy, drama, fantasy",
      "imageName": "onepiece"
    },
    {
      "name": "Love Hina",
      "id": 4,
      "rating": "8.16",
      "author": "Ken Akamatsu",
      "chapterNumber": "121",
      "description": "When he was a child, Keitaro Urashima promised with a girl that they would meet in Tokyo University (Toudai). For this reason he has tried to get into the prestigious university, but has failed the entrance exam two years in a row. When his parents kick him out of the house he tries to find lodging at his Grandmother's inn, but unbeknownst to him it has been changed into an all-girls dormitory. He is allowed to stay in the position of kanrinin (dorm manager) but his clumsiness tends to land him in trouble with the girls. To achieve his dream, he studies to pass the Tokyo University exam along with Naru Narusegawa, who has her own reasons for wanting to get into Toudai.",
      "price": "$0.8",
      "genres": "comedy, drama, romance",
      "imageName": "lovehina"
    },
    {
      "name": "Fullmetal Alchemist",
      "id": 5,
      "rating": "8.97",
      "author": "Hiromu Arakawa",
      "chapterNumber": "116",
      "description": "When two brothers, Edward and Alphonse Elric tried to revive their mother using Alchemy, something went drastically wrong. Edward lost his leg and his arm, and Alphonse lost his entire body. Now, a few years later, Edward becomes what's known as a 'State Alchemist' or a Nationally recognized Alchemist. Along with Alphonse, who's spirit has been put into a metal suit of armor, and his Automail leg and arm, the two brothers set out to find a way to restore themselves",
      "price": "$1",
      "genres": "adventure, comedy, drama, fantasy",
      "imageName": "fullmetal"
    }
]
